simops/templates/Golden_CHT_Case/0/fluid/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}

// ========================================================================== //
// Golden CHT Case - Fluid Temperature Field                                  //
// ========================================================================== //

dimensions      [0 0 0 1 0 0 0];

// VARIABLE: internalField - Initial temperature [K]
internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        // VARIABLE: inletValue - Inlet temperature [K]
        value           uniform 300;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    
    topWall
    {
        type            zeroGradient;
    }
    
    bottomWall
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            zeroGradient;
    }
    
    // Interface to solid regions - coupled boundary condition
    "fluid_to_.*"
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        value           $internalField;
    }
}
