simops/templates/Golden_CHT_Case/0/fluid/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}

// ========================================================================== //
// Golden CHT Case - Fluid Velocity Field                                     //
// ========================================================================== //

dimensions      [0 1 -1 0 0 0 0];

// VARIABLE: internalField - Initial velocity [m/s]
internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        // VARIABLE: inletVelocity - Inlet velocity [m/s]
        // Default: 1 m/s in +X direction (gentle flow)
        value           uniform (1 0 0);
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (1 0 0);
    }
    
    topWall
    {
        type            noSlip;
    }
    
    bottomWall
    {
        type            noSlip;
    }
    
    frontAndBack
    {
        type            noSlip;
    }
    
    // Interface to solid regions - no-slip wall
    "fluid_to_.*"
    {
        type            noSlip;
    }
}
