simops/templates/Golden_CHT_Case/0/fluid/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}

// ========================================================================== //
// Golden CHT Case - Fluid Pressure Field (p - rho*g*h)                       //
// ========================================================================== //

dimensions      [1 -1 -2 0 0 0 0];

// VARIABLE: internalField - Initial pressure [Pa]
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    outlet
    {
        type            fixedValue;
        // VARIABLE: outletPressure - Outlet gauge pressure [Pa]
        value           uniform 0;
    }
    
    topWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    bottomWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    frontAndBack
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    // Interface to solid regions
    "fluid_to_.*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}
