simops/templates/Golden_CHT_Case/0/region1/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region1";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    
    topWall
    {
        type            zeroGradient;
    }
    
    bottomWall
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            zeroGradient;
    }
    
    region1_to_solid_heatsink
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        value           $internalField;
    }
}
