simops/templates/Golden_CHT_Case/0/region1/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/region1";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (1 0 0);
    }
    
    topWall
    {
        type            noSlip;
    }
    
    bottomWall
    {
        type            noSlip;
    }
    
    frontAndBack
    {
        type            noSlip;
    }
    
    region1_to_solid_heatsink
    {
        type            noSlip;
    }
}
