simops/templates/Golden_CHT_Case/0/region1/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region1";
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    topWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    bottomWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    frontAndBack
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    region1_to_solid_heatsink
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}
