simops/templates/Golden_CHT_Case/constant/region1/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/region1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       84000;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       84400;
    }
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       84800;
    }
    frontAndBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       86400;
    }
    region1_to_solid_heatsink
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mapped
)
;
        nFaces          6400;
        startFace       87200;
        neighbourRegion solid_heatsink;
        neighbourPatch  solid_heatsink_to_region1;
        transformType   none;
    }
)

// ************************************************************************* //
