simops/templates/Golden_CHT_Case/constant/solid_heatsink/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid_heatsink/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          580;
        startFace       100440;
    }
    outlet
    {
        type            patch;
        nFaces          580;
        startFace       101020;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       101600;
    }
    frontAndBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1160;
        startFace       102000;
    }
    solid_heatsink_to_region1
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mapped
)
;
        nFaces          6400;
        startFace       103160;
        neighbourRegion region1;
        neighbourPatch  region1_to_solid_heatsink;
        transformType   none;
    }
)

// ************************************************************************* //
