simops/templates/Golden_CHT_Case/constant/solid_heatsink/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/solid_heatsink";
    object      thermophysicalProperties;
}

// ========================================================================== //
// Golden CHT Case - Heatsink (Aluminum 6061) Thermophysical Properties       //
// OpenFOAM 13 compatible format with constIsoSolid + eConst                   //
// ========================================================================== //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIsoSolid;    // OpenFOAM 13: isotropic constant solid
    thermo          eConst;           // OpenFOAM 13: eConst for solid (not hConst)
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;  // Use internal energy for solids
}

mixture
{
    specie
    {
        molWeight   26.98;  // Aluminum molecular weight [kg/kmol]
    }
    thermodynamics
    {
        // VARIABLE: Cv - Specific heat at constant volume (approx = Cp for solids)
        Cv          896;    // [J/kg/K]
        Hf          0;
    }
    transport
    {
        // VARIABLE: kappa - Thermal conductivity
        kappa       167;    // [W/m/K] for Al 6061
    }
    equationOfState
    {
        // VARIABLE: rho - Density
        rho         2700;   // [kg/m^3]
    }
}
