simops/templates/Golden_CHT_Case/system/fluid/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSchemes;
}

// Inherit from main fvSchemes
#include "../fvSchemes"
