simops/templates/Golden_CHT_Case/system/fluid/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}

// Inherit from main fvSolution
#include "../fvSolution"
