simops/templates/Golden_CHT_Case/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// ========================================================================== //
// Golden CHT Case - Global fvSchemes                                         //
// FIRST-ORDER UPWIND for Maximum Stability on Dirty CAD                      //
// ========================================================================== //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
}

divSchemes
{
    default         none;
    
    // STABILITY: First-order upwind for all convective terms
    // This sacrifices accuracy for robustness on poor meshes
    div(phi,U)      Gauss upwind;
    div(phi,K)      Gauss upwind;
    div(phi,h)      Gauss upwind;
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,omega)  Gauss upwind;
    
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.5;
}

// Wall distance calculation (needed for turbulence)
wallDist
{
    method          meshWave;
}
