simops/templates/Golden_CHT_Case/system/region1/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/region1";
    object      fvSchemes;
}

// Inherit from main fvSchemes for fluid region
#include "../fvSchemes"
