simops/templates/Golden_CHT_Case/system/solid_heatsink/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/solid_heatsink";
    object      fvSchemes;
}

// ========================================================================== //
// Golden CHT Case - Solid Region fvSchemes                                   //
// Simplified for heat conduction only                                        //
// ========================================================================== //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}
