simops/templates/Golden_CHT_Case/system/solid_heatsink/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/solid_heatsink";
    object      fvSolution;
}

// ========================================================================== //
// Golden CHT Case - Solid Region fvSolution                                  //
// ========================================================================== //

solvers
{
    h
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.1;
    }

    hFinal
    {
        $h;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
}
